{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_76","layers":[{"class_name":"Sequential","config":{"name":"sequential_73","layers":[{"class_name":"Model","config":{"name":"model19","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":[null,224,224,3],"dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"Conv1_pad","class_name":"ZeroPadding2D","config":{"padding":[[0,1],[0,1]],"data_format":"channels_last","name":"Conv1_pad"},"inbound_nodes":[[["input_1",0,0,{}]]]},{"name":"conv1","class_name":"Conv2D","config":{"name":"conv1","trainable":false,"filters":32,"kernel_size":[3,3],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2.0,"mode":"fan_out","distribution":"truncated_normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["Conv1_pad",0,0,{}]]]},{"name":"bn_Conv1","class_name":"BatchNormalization","config":{"name":"bn_Conv1","trainable":false,"axis":3,"momentum":0.999,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null},"inbound_nodes":[[["conv1",0,0,{}]]]},{"name":"Conv1_relu","class_name":"ReLU","config":{"name":"Conv1_relu","trainable":false,"max_value":6.0,"negative_slope":0.0,"threshold":0.0},"inbound_nodes":[[["bn_Conv1",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["Conv1_relu",0,0]]},"inbound_nodes":[[["sequential_69_input",0,0,{}]]]},{"class_name":"GlobalAveragePooling2D","config":{"name":"global_average_pooling2d_19","trainable":true,"data_format":"channels_last","keepdims":false},"inbound_nodes":[[["sequential_73",0,0,{}]]]},{"class_name":"Dropout","config":{"name":"dropout_19","trainable":true,"rate":0.001,"noise_shape":null,"seed":null},"inbound_nodes":[[["global_average_pooling2d_19",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_19","trainable":true,"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"inbound_nodes":[[["dropout_19",0,0,{}]]]}],"input_layers":[["sequential_69_input",0,0]],"output_layers":[["dense_19",0,0]]}},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"sequential_73/model19/conv1/kernel","shape":[3,3,3,32],"dtype":"float32"},{"name":"sequential_73/model19/bn_Conv1/gamma","shape":[32],"dtype":"float32"},{"name":"sequential_73/model19/bn_Conv1/beta","shape":[32],"dtype":"float32"},{"name":"sequential_73/model19/bn_Conv1/moving_mean","shape":[32],"dtype":"float32"},{"name":"sequential_73/model19/bn_Conv1/moving_variance","shape":[32],"dtype":"float32"},{"name":"dense_19/kernel","shape":[1024,2],"dtype":"float32"},{"name":"dense_19/bias","shape":[2],"dtype":"float32"}]}]}
